In [2]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [3]:
new_df = df.copy()
new_df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [4]:
new_df.loc[1,"Age"] = None

In [5]:
new_df

      Name   Age
0    Alice  25.0
1      Bob   NaN
2  Charlie  35.0
3    David  40.0
4      Eve  45.0

In [ ]:
# 欠損値が存在する行を削除
# 重要なデータの可能性もあるので、一般的には削除せずに補完してあげるのが良い
new_df.dropna()

      Name   Age
0    Alice  25.0
2  Charlie  35.0
3    David  40.0
4      Eve  45.0